In [1]:
import pandas as pd

In [9]:
df = pd.read_csv("./purchases.txt", delimiter="\t", names = ['date', 'time', 'place', 'type', 'price', 'payment_type'])

In [18]:
df['time'] = df.apply(lambda x: x['time'].split(":")[0], axis = 1, result_type = 'expand')

In [ ]:
df

In [24]:
df.groupby('time').mean()

           price
time
09    249.672185
10    250.056104
11    249.928080
12    249.855358
13    250.258298
14    249.822076
15    250.073113
16    250.243684
17    249.740575

In [27]:
 df.groupby('time')['price'].max()

time
09    499.99
10    499.99
11    499.99
12    499.99
13    499.99
14    499.99
15    499.99
16    499.99
17    499.99
Name: price, dtype: float64

In [28]:
 df.groupby('time')['price'].min()

time
09    0.0
10    0.0
11    0.0
12    0.0
13    0.0
14    0.0
15    0.0
16    0.0
17    0.0
Name: price, dtype: float64

In [29]:
 df.groupby('time')['price'].std()

time
09    144.404425
10    144.497425
11    144.269663
12    144.284005
13    144.282950
14    144.435415
15    144.145912
16    144.229889
17    144.306676
Name: price, dtype: float64

In [21]:
df[['time', 'price']].head(5)

  time   price
0   09  214.05
1   09  153.57
2   09   66.08
3   09  493.51
4   09  235.63

,date,time,place,type,price,payment_type
0,2012-01-01,09,San Jose,Men's Clothing,214.05,Amex
1,2012-01-01,09,Fort Worth,Women's Clothing,153.57,Visa
2,2012-01-01,09,San Diego,Music,66.08,Cash
3,2012-01-01,09,Pittsburgh,Pet Supplies,493.51,Discover
4,2012-01-01,09,Omaha,Children's Clothing,235.63,MasterCard
...,...,...,...,...,...,...
4138471,2012-12-31,17,Albuquerque,Toys,345.70,MasterCard
4138472,2012-12-31,17,Rochester,DVDs,399.57,Amex
4138473,2012-12-31,17,Greensboro,Baby,277.27,Discover
4138474,2012-12-31,17,Arlington,Women's Clothing,134.95,MasterCard
4138475,2012-12-31,17,Corpus Christi,DVDs,441.61,Discover